In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
df = pd.read_csv('StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

## 1. Find out how many males and females participated in the test.

In [12]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

## 2. What do you think about the students' parental level of education?

In [13]:
par_ed = df['parental level of education']
par_ed

0        some high school
1             high school
2        some high school
3            some college
4            some college
              ...
995          some college
996          some college
997          some college
998    associate's degree
999     bachelor's degree
Name: parental level of education, Length: 1000, dtype: object

In [14]:
par_ed.value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

## 3. Who scores the most on average for math, reading and writing based on
## ● Gender

In [15]:
math_g = df[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').mean()

In [16]:
math_g

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

#### Male students have higher average in maths score,female students have higher average reading and writing score.

## ● Test preparation course

In [20]:
math_t = df[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').mean()

In [21]:
math_t

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

#### Students who did test preparation course have higher average score

## 4. What do you think about the scoring variation for math, reading and writing based on
## ● Gender

In [23]:
var_g = df[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').std()

In [24]:
var_g

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

#### male students have less variations

## ● Test preparation course

In [26]:
var_t = df[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').std()

In [27]:
var_t

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

## 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [30]:
df.nlargest(250, ['math score'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62